Repository: softwarelivre/segue
Catalog: segue/translations/*/LC_MESSAGES/messages.po
Languages: pt

source: Missing data for required field.
pt: Este campo é obrigatório.

source: Invalid input type.
pt: O valor deste campo está inválido.

source: Field may not be null.
pt: Este campo não pode ficar vazio.

source: Invalid value.
pt: O valor deste campo está inválido.

source: Not a valid integer.
pt: Número inválido.

source: Not a valid string.
pt: O valor deste campo está inválido.

source: Not a valid boolean.
pt: O valor deste campo está inválido.

source: Not a valid date.
pt: A data informada não é válida

source: "{input}" cannot be formatted as a date.
pt: "{input}" não é um formato de data válido.

source: Not a valid choice.
pt: Está não é uma escolha válida.

source: Not a valid email address.
pt: Este não é um endereço de e-mail válido.

source: Shorter than minimum length {min}.
pt: Este campo deve ter no mínimo {min} caracteres.

source: Longer than maximum length {max}.
pt: Este campo deve ter no máximo {max} caracteres.

source: Length must be between {min} and {max}.
pt: Este campo deve ter entre {min} e {max} caracteres.

source: Length must be {equal}.
pt: Este campo deve ter {equal} caracteres.

source: This document is already registered
pt: Este documento já foi cadastrado no sistema

source: This e-mail address is already registered
pt: Este endereço de e-mail já está em uso

source: Invalid CPF number
pt: Número do CPF inválido

source: Invalid CNPJ number
pt: Número do CNPJ inválido

source: Email does not match
pt: Os e-mails não são iguais

source: Password does not match
pt: As senhas não são iguais

source: Invalid document format.
pt: O formato do documento parece estar inválido

source: Document could not be generated.
pt: Não foi possível gerar o documento

source: Document could not be saved.
pt: Nào foi possível salvar o documento

source: Max purchased reached
pt: O limite de compras para esse produto foi atingido

source: You must define a document number
pt: Você precisa fornecer um documento válido

source: You must define a student document
pt: Você precisa definir um documento que comprove o seu vínculo estudantil

source: The student document {} is not valid
pt: O documento de estudante {} não parece ser válido
